### Retrieving Records
**Referencing an Aliased Column in the WHERE Clause**  
We can't use an alias in WHERE clause, to do that we have to:

In [1]:
# %%
%load_ext sql

# %%
%sql mysql+mysqldb://root:root@localhost/employees

'Connected: root@employees'

In [3]:
%%sql

SELECT *
FROM
(
    SELECT birth_date AS dob
    FROM employees
) subquery
WHERE YEAR(dob) < '1970'
LIMIT 5;

 * mysql+mysqldb://root:***@localhost/employees
5 rows affected.

[(datetime.date(1953, 9, 2),),
 (datetime.date(1964, 6, 2),),
 (datetime.date(1959, 12, 3),),
 (datetime.date(1954, 5, 1),),
 (datetime.date(1955, 1, 21),)]

Note that not all databases have LIMIT keyword, for example in Oracle we need to use ROWNUM.

**Returning n Random Records from a Table**  
We need to make use of database specific random function in ORDER BY clause

In [4]:
%%sql

SELECT * FROM departments
ORDER BY RAND() LIMIT 5;

 * mysql+mysqldb://root:***@localhost/employees
5 rows affected.

[('d006', 'Quality Management'),
 ('d008', 'Research'),
 ('d004', 'Production'),
 ('d002', 'Finance'),
 ('d005', 'Development')]

**Selecting Minimum and Maximum**

In [12]:
%%sql

SELECT * FROM learning.pokemon p WHERE hp IN (
    SELECT MIN(hp) FROM learning.pokemon 
    UNION 
    SELECT MAX(hp) FROM learning.pokemon)
ORDER BY hp;

 * mysql+mysqldb://root:***@localhost/employees
2 rows affected.

[('292', 'Shedinja', 'Bug', 'Ghost', 236, 1, 90, 45, 30, 30, 40, 3, None),
 ('242', 'Blissey', 'Normal', '', 540, 255, 10, 10, 75, 135, 55, 2, None)]

**Selecting Records Alternatively** select odd or even rows, or skip a particular record number, all done using `ROW_NUMBER` window function

In [16]:
%%sql

SELECT * FROM
(
    SELECT *, ROW_NUMBER() OVER (ORDER BY emp_no) rn
    FROM employees
) tmp
WHERE MOD(tmp.rn, 2) = 1
LIMIT 10

 * mysql+mysqldb://root:***@localhost/employees
10 rows affected.

[(10001, datetime.date(1953, 9, 2), 'Georgi', 'Facello', 'M', datetime.date(1986, 6, 26), 1),
 (10003, datetime.date(1959, 12, 3), 'Parto', 'Bamford', 'M', datetime.date(1986, 8, 28), 3),
 (10005, datetime.date(1955, 1, 21), 'Kyoichi', 'Maliniak', 'M', datetime.date(1989, 9, 12), 5),
 (10007, datetime.date(1957, 5, 23), 'Tzvetan', 'Zielinski', 'F', datetime.date(1989, 2, 10), 7),
 (10009, datetime.date(1952, 4, 19), 'Sumant', 'Peac', 'F', datetime.date(1985, 2, 18), 9),
 (10011, datetime.date(1953, 11, 7), 'Mary', 'Sluis', 'F', datetime.date(1990, 1, 22), 11),
 (10013, datetime.date(1963, 6, 7), 'Eberhardt', 'Terkki', 'M', datetime.date(1985, 10, 20), 13),
 (10015, datetime.date(1959, 8, 19), 'Guoxiang', 'Nooteboom', 'M', datetime.date(1987, 7, 2), 15),
 (10017, datetime.date(1958, 7, 6), 'Cristinel', 'Bouloucos', 'F', datetime.date(1993, 8, 3), 17),
 (10019, datetime.date(1953, 1, 23), 'Lillian', 'Haddadi', 'M', datetime.date(1999, 4, 30), 19)]

**Pagination** we can use combination of `LIMIT` and `OFFSET` to paginate items, another way is to use `ROW_NUMBER`

In [17]:
%%sql

SELECT 2 INTO @page;
SELECT 12 INTO @window_size;


SELECT * FROM(
    SELECT *, ROW_NUMBER() OVER (ORDER BY emp_no) rn
    FROM(
        SELECT * FROM employees
    ) tmp1
)tmp2
WHERE rn BETWEEN (@window_size*(@page-1) + 1) AND (@window_size*@page);

 * mysql+mysqldb://root:***@localhost/employees
1 rows affected.
1 rows affected.
12 rows affected.

[(10013, datetime.date(1963, 6, 7), 'Eberhardt', 'Terkki', 'M', datetime.date(1985, 10, 20), 13),
 (10014, datetime.date(1956, 2, 12), 'Berni', 'Genin', 'M', datetime.date(1987, 3, 11), 14),
 (10015, datetime.date(1959, 8, 19), 'Guoxiang', 'Nooteboom', 'M', datetime.date(1987, 7, 2), 15),
 (10016, datetime.date(1961, 5, 2), 'Kazuhito', 'Cappelletti', 'M', datetime.date(1995, 1, 27), 16),
 (10017, datetime.date(1958, 7, 6), 'Cristinel', 'Bouloucos', 'F', datetime.date(1993, 8, 3), 17),
 (10018, datetime.date(1954, 6, 19), 'Kazuhide', 'Peha', 'F', datetime.date(1987, 4, 3), 18),
 (10019, datetime.date(1953, 1, 23), 'Lillian', 'Haddadi', 'M', datetime.date(1999, 4, 30), 19),
 (10020, datetime.date(1952, 12, 24), 'Mayuko', 'Warwick', 'M', datetime.date(1991, 1, 26), 20),
 (10021, datetime.date(1960, 2, 20), 'Ramzi', 'Erde', 'M', datetime.date(1988, 2, 10), 21),
 (10022, datetime.date(1952, 7, 8), 'Shahaf', 'Famili', 'M', datetime.date(1995, 8, 22), 22),
 (10023, datetime.date(1953, 9, 29), 'Bojan', 'Montemayor', 'F', datetime.date(1989, 12, 17), 23),
 (10024, datetime.date(1958, 9, 5), 'Suzette', 'Pettey', 'F', datetime.date(1997, 5, 19), 24)]

In [19]:
%%sql

-- # Without ROW_NUMBER
SELECT 2 INTO @page;
SELECT 12 INTO @window_size;
SELECT 0 INTO @rownum;

SELECT * FROM(
    SELECT @rownum:=@rownum+1 AS rn ,tmp1.* FROM(
        SELECT * FROM employees
    ) tmp1
)tmp2
WHERE rn BETWEEN (@window_size*(@page-1) + 1) AND (@window_size*@page);

 * mysql+mysqldb://root:***@localhost/employees
1 rows affected.
1 rows affected.
1 rows affected.
12 rows affected.

[(13, 10013, datetime.date(1963, 6, 7), 'Eberhardt', 'Terkki', 'M', datetime.date(1985, 10, 20)),
 (14, 10014, datetime.date(1956, 2, 12), 'Berni', 'Genin', 'M', datetime.date(1987, 3, 11)),
 (15, 10015, datetime.date(1959, 8, 19), 'Guoxiang', 'Nooteboom', 'M', datetime.date(1987, 7, 2)),
 (16, 10016, datetime.date(1961, 5, 2), 'Kazuhito', 'Cappelletti', 'M', datetime.date(1995, 1, 27)),
 (17, 10017, datetime.date(1958, 7, 6), 'Cristinel', 'Bouloucos', 'F', datetime.date(1993, 8, 3)),
 (18, 10018, datetime.date(1954, 6, 19), 'Kazuhide', 'Peha', 'F', datetime.date(1987, 4, 3)),
 (19, 10019, datetime.date(1953, 1, 23), 'Lillian', 'Haddadi', 'M', datetime.date(1999, 4, 30)),
 (20, 10020, datetime.date(1952, 12, 24), 'Mayuko', 'Warwick', 'M', datetime.date(1991, 1, 26)),
 (21, 10021, datetime.date(1960, 2, 20), 'Ramzi', 'Erde', 'M', datetime.date(1988, 2, 10)),
 (22, 10022, datetime.date(1952, 7, 8), 'Shahaf', 'Famili', 'M', datetime.date(1995, 8, 22)),
 (23, 10023, datetime.date(1953, 9, 29), 'Bojan', 'Montemayor', 'F', datetime.date(1989, 12, 17)),
 (24, 10024, datetime.date(1958, 9, 5), 'Suzette', 'Pettey', 'F', datetime.date(1997, 5, 19))]

In [ ]:
-- # Below will not work because we can't pass variable to limit
SELECT * FROM(
    SELECT * FROM employees
)tmp
LIMIT @window_size
OFFSET (@window_size*(@page-1) + 1)

-- # Instead pass dynamically generated SQL
SELECT * FROM(
    SELECT * FROM employees
)tmp
LIMIT 12
OFFSET 0

### Sorting Result
**Sorting Mixed Alphanumeric Data** uses `REGEXP_SUBSTR` function which is available in MySQL 8+

In [5]:
%%sql

SELECT department_code FROM learning.data
WHERE department_code IS NOT NULL
ORDER BY CAST(REGEXP_SUBSTR(department_code, '[0-9]+') AS UNSIGNED);

 * mysql+mysqldb://root:***@localhost/employees
10 rows affected.

[('SUPPORT 5',),
 ('HR 21',),
 ('MARKT 24',),
 ('MARKT 24',),
 ('DEV 32',),
 ('HR 55',),
 ('DEV 56',),
 ('SALES 87',),
 ('MANU 89',),
 ('RSCH 112',)]

**Conditional Sorting** we can use CASE clause in ORDER BY:

In [7]:
%%sql

SELECT * FROM employees
ORDER BY CASE WHEN gender = 'M' THEN first_name ELSE last_name END
LIMIT 10

 * mysql+mysqldb://root:***@localhost/employees
10 rows affected.

[(11800, datetime.date(1958, 12, 9), 'Aamer', 'Fraisse', 'M', datetime.date(1990, 8, 8)),
 (24404, datetime.date(1960, 4, 21), 'Aamer', 'Tsukuda', 'M', datetime.date(1998, 12, 25)),
 (31646, datetime.date(1962, 8, 10), 'Aamer', 'Matzel', 'M', datetime.date(1991, 8, 5)),
 (23269, datetime.date(1952, 2, 15), 'Aamer', 'Szmurlo', 'M', datetime.date(1988, 5, 25)),
 (30404, datetime.date(1957, 10, 8), 'Aamer', 'Basawa', 'M', datetime.date(1985, 7, 17)),
 (32854, datetime.date(1959, 8, 3), 'Aamer', 'Unni', 'M', datetime.date(1989, 8, 6)),
 (29217, datetime.date(1959, 5, 14), 'Aamer', 'Bridgland', 'M', datetime.date(1991, 1, 31)),
 (12160, datetime.date(1954, 12, 11), 'Aamer', 'Garrabrants', 'M', datetime.date(1989, 9, 19)),
 (22279, datetime.date(1959, 1, 30), 'Aamer', 'Kornyak', 'M', datetime.date(1985, 2, 25)),
 (11935, datetime.date(1963, 3, 23), 'Aamer', 'Jayawardene', 'M', datetime.date(1996, 10, 26))]

### Insert Delete and Update
**Inserting Default Values** use the `DEFAULT` keyword or empty paranthesis (MySQL specific)

In [ ]:
%%sql

INSERT INTO employees VALUES (DEFAULT);
INSERT INTO employees VALUES ();

**Updating with Values from Another Table** in example below we update salary in salaries table with value from new_salaries table

In [ ]:
%%sql

UPDATE salaries s, new_salaries ns
SET s.salary = ns.salary
WHERE s.emp_no = ns.emp_no

**Deleting Duplicates** two duplicate records have the same value in every column except for the PK column

In [ ]:
%%sql

-- Does not work in MySQL because you cannot reference same table twice in DELETE 
DELETE FROM learning.pokemon
WHERE serial NOT IN
(
    SELECT MIN(p.serial)
    FROM learning.pokemon p
    GROUP BY p.name
)

-- Works
DELETE FROM learning.pokemon
WHERE serial NOT IN
(
    SELECT MIN(tmp.serial)
    FROM 
        (
            SELECT serial, name 
            FROM learning.pokemon
        ) tmp
    GROUP BY tmp.name
)

### Metadata Query
Below queries are MySQL specific, different databases such as Oracle may need different query
**List Tables in a Schema**

In [8]:
%%sql

SELECT table_name
FROM information_schema.tables
WHERE table_schema = 'employees'

 * mysql+mysqldb://root:***@localhost/employees
8 rows affected.

[('current_dept_emp',),
 ('departments',),
 ('dept_emp',),
 ('dept_emp_latest_date',),
 ('dept_manager',),
 ('employees',),
 ('salaries',),
 ('titles',)]

**Listing Table Columns**

In [9]:
%%sql

SELECT column_name, data_type, ordinal_position
FROM information_schema.columns
WHERE table_schema = 'employees'
AND table_name = 'employees'

 * mysql+mysqldb://root:***@localhost/employees
6 rows affected.

[('birth_date', 'date', 2),
 ('emp_no', 'int', 1),
 ('first_name', 'varchar', 3),
 ('gender', 'enum', 5),
 ('hire_date', 'date', 6),
 ('last_name', 'varchar', 4)]

**Listing Indexed Columns**

In [11]:
%%sql

SHOW INDEX FROM employees

 * mysql+mysqldb://root:***@localhost/employees
1 rows affected.

[('employees', 0, 'PRIMARY', 1, 'emp_no', 'A', 299335, None, None, '', 'BTREE', '', '', 'YES', None)]